renesas/micropython/ports/ra/boards/RA6M2_EK/ra_gen/hal_data.c
/* generated HAL source file - do not edit */
#include "hal_data.h"
/* Macros to tie dynamic ELC links to ADC_TRIGGER_SYNC_ELC option in adc_trigger_t. */
#define ADC_TRIGGER_ADC0        ADC_TRIGGER_SYNC_ELC
#define ADC_TRIGGER_ADC0_B      ADC_TRIGGER_SYNC_ELC
#define ADC_TRIGGER_ADC1        ADC_TRIGGER_SYNC_ELC
#define ADC_TRIGGER_ADC1_B      ADC_TRIGGER_SYNC_ELC
lpm_instance_ctrl_t g_lpm0_ctrl;

const lpm_cfg_t g_lpm0_cfg = { .low_power_mode = LPM_MODE_SLEEP,
		.snooze_cancel_sources = LPM_SNOOZE_CANCEL_SOURCE_NONE,
		.standby_wake_sources = (lpm_standby_wake_source_t) 0,
		.snooze_request_source = LPM_SNOOZE_REQUEST_RXD0_FALLING,
		.snooze_end_sources = (lpm_snooze_end_t) 0, .dtc_state_in_snooze =
				LPM_SNOOZE_DTC_DISABLE,
#if BSP_FEATURE_LPM_HAS_SBYCR_OPE
    .output_port_enable         = LPM_OUTPUT_PORT_ENABLE_RETAIN,
#endif
#if BSP_FEATURE_LPM_HAS_DEEP_STANDBY
    .io_port_state              = LPM_IO_PORT_NO_CHANGE,
    .power_supply_state         = LPM_POWER_SUPPLY_DEEPCUT0,
    .deep_standby_cancel_source =  (lpm_deep_standby_cancel_source_t) 0,
    .deep_standby_cancel_edge   =  (lpm_deep_standby_cancel_edge_t) 0,
#endif
		.p_extend = NULL, };

const lpm_instance_t g_lpm0 = { .p_api = &g_lpm_on_lpm, .p_ctrl = &g_lpm0_ctrl,
		.p_cfg = &g_lpm0_cfg };
iic_master_instance_ctrl_t g_i2c_master2_ctrl;
const iic_master_extended_cfg_t g_i2c_master2_extend =
		{ .timeout_mode = IIC_MASTER_TIMEOUT_MODE_SHORT,
				/* Actual calculated bitrate: 98945. Actual calculated duty cycle: 51%. */.clock_settings.brl_value =
						15, .clock_settings.brh_value = 16,
				.clock_settings.cks_value = 4, };
const i2c_master_cfg_t g_i2c_master2_cfg = { .channel = 2, .rate =
		I2C_MASTER_RATE_STANDARD, .slave = 0x00, .addr_mode =
		I2C_MASTER_ADDR_MODE_7BIT,
#define RA_NOT_DEFINED (1)
#if (RA_NOT_DEFINED == RA_NOT_DEFINED)
		.p_transfer_tx = NULL,
#else
                .p_transfer_tx       = &RA_NOT_DEFINED,
#endif
#if (RA_NOT_DEFINED == RA_NOT_DEFINED)
		.p_transfer_rx = NULL,
#else
                .p_transfer_rx       = &RA_NOT_DEFINED,
#endif
#undef RA_NOT_DEFINED
		.p_callback = callback_i2c, .p_context = NULL,
#if defined(VECTOR_NUMBER_IIC2_RXI)
    .rxi_irq             = VECTOR_NUMBER_IIC2_RXI,
#else
		.rxi_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_IIC2_TXI)
    .txi_irq             = VECTOR_NUMBER_IIC2_TXI,
#else
		.txi_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_IIC2_TEI)
    .tei_irq             = VECTOR_NUMBER_IIC2_TEI,
#else
		.tei_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_IIC2_ERI)
    .eri_irq             = VECTOR_NUMBER_IIC2_ERI,
#else
		.eri_irq = FSP_INVALID_VECTOR,
#endif
		.ipl = (12), .p_extend = &g_i2c_master2_extend, };
/* Instance structure to use this module. */
const i2c_master_instance_t g_i2c_master2 = { .p_ctrl = &g_i2c_master2_ctrl,
		.p_cfg = &g_i2c_master2_cfg, .p_api = &g_i2c_master_on_iic };
iic_master_instance_ctrl_t g_i2c_master1_ctrl;
const iic_master_extended_cfg_t g_i2c_master1_extend =
		{ .timeout_mode = IIC_MASTER_TIMEOUT_MODE_SHORT,
				/* Actual calculated bitrate: 98945. Actual calculated duty cycle: 51%. */.clock_settings.brl_value =
						15, .clock_settings.brh_value = 16,
				.clock_settings.cks_value = 4, };
const i2c_master_cfg_t g_i2c_master1_cfg = { .channel = 1, .rate =
		I2C_MASTER_RATE_STANDARD, .slave = 0x00, .addr_mode =
		I2C_MASTER_ADDR_MODE_7BIT,
#define RA_NOT_DEFINED (1)
#if (RA_NOT_DEFINED == RA_NOT_DEFINED)
		.p_transfer_tx = NULL,
#else
                .p_transfer_tx       = &RA_NOT_DEFINED,
#endif
#if (RA_NOT_DEFINED == RA_NOT_DEFINED)
		.p_transfer_rx = NULL,
#else
                .p_transfer_rx       = &RA_NOT_DEFINED,
#endif
#undef RA_NOT_DEFINED
		.p_callback = callback_i2c, .p_context = NULL,
#if defined(VECTOR_NUMBER_IIC1_RXI)
    .rxi_irq             = VECTOR_NUMBER_IIC1_RXI,
#else
		.rxi_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_IIC1_TXI)
    .txi_irq             = VECTOR_NUMBER_IIC1_TXI,
#else
		.txi_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_IIC1_TEI)
    .tei_irq             = VECTOR_NUMBER_IIC1_TEI,
#else
		.tei_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_IIC1_ERI)
    .eri_irq             = VECTOR_NUMBER_IIC1_ERI,
#else
		.eri_irq = FSP_INVALID_VECTOR,
#endif
		.ipl = (12), .p_extend = &g_i2c_master1_extend, };
/* Instance structure to use this module. */
const i2c_master_instance_t g_i2c_master1 = { .p_ctrl = &g_i2c_master1_ctrl,
		.p_cfg = &g_i2c_master1_cfg, .p_api = &g_i2c_master_on_iic };
iic_master_instance_ctrl_t g_i2c_master0_ctrl;
const iic_master_extended_cfg_t g_i2c_master0_extend =
		{ .timeout_mode = IIC_MASTER_TIMEOUT_MODE_SHORT,
				/* Actual calculated bitrate: 98945. Actual calculated duty cycle: 51%. */.clock_settings.brl_value =
						15, .clock_settings.brh_value = 16,
				.clock_settings.cks_value = 4, };
const i2c_master_cfg_t g_i2c_master0_cfg = { .channel = 0, .rate =
		I2C_MASTER_RATE_STANDARD, .slave = 0x00, .addr_mode =
		I2C_MASTER_ADDR_MODE_7BIT,
#define RA_NOT_DEFINED (1)
#if (RA_NOT_DEFINED == RA_NOT_DEFINED)
		.p_transfer_tx = NULL,
#else
                .p_transfer_tx       = &RA_NOT_DEFINED,
#endif
#if (RA_NOT_DEFINED == RA_NOT_DEFINED)
		.p_transfer_rx = NULL,
#else
                .p_transfer_rx       = &RA_NOT_DEFINED,
#endif
#undef RA_NOT_DEFINED
		.p_callback = callback_i2c, .p_context = NULL,
#if defined(VECTOR_NUMBER_IIC0_RXI)
    .rxi_irq             = VECTOR_NUMBER_IIC0_RXI,
#else
		.rxi_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_IIC0_TXI)
    .txi_irq             = VECTOR_NUMBER_IIC0_TXI,
#else
		.txi_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_IIC0_TEI)
    .tei_irq             = VECTOR_NUMBER_IIC0_TEI,
#else
		.tei_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_IIC0_ERI)
    .eri_irq             = VECTOR_NUMBER_IIC0_ERI,
#else
		.eri_irq = FSP_INVALID_VECTOR,
#endif
		.ipl = (12), .p_extend = &g_i2c_master0_extend, };
/* Instance structure to use this module. */
const i2c_master_instance_t g_i2c_master0 = { .p_ctrl = &g_i2c_master0_ctrl,
		.p_cfg = &g_i2c_master0_cfg, .p_api = &g_i2c_master_on_iic };
icu_instance_ctrl_t g_external_irq15_ctrl;
const external_irq_cfg_t g_external_irq15_cfg = { .channel = 15, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callbackup_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ15)
    .irq                 = VECTOR_NUMBER_ICU_IRQ15,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq15 = { .p_ctrl =
		&g_external_irq15_ctrl, .p_cfg = &g_external_irq15_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq14_ctrl;
const external_irq_cfg_t g_external_irq14_cfg = { .channel = 14, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callbackup_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ14)
    .irq                 = VECTOR_NUMBER_ICU_IRQ14,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq14 = { .p_ctrl =
		&g_external_irq14_ctrl, .p_cfg = &g_external_irq14_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq13_ctrl;
const external_irq_cfg_t g_external_irq13_cfg = { .channel = 13, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callbackup_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ13)
    .irq                 = VECTOR_NUMBER_ICU_IRQ13,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq13 = { .p_ctrl =
		&g_external_irq13_ctrl, .p_cfg = &g_external_irq13_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq12_ctrl;
const external_irq_cfg_t g_external_irq12_cfg = { .channel = 12, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callbackup_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ12)
    .irq                 = VECTOR_NUMBER_ICU_IRQ12,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq12 = { .p_ctrl =
		&g_external_irq12_ctrl, .p_cfg = &g_external_irq12_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq11_ctrl;
const external_irq_cfg_t g_external_irq11_cfg = { .channel = 11, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callbackup_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ11)
    .irq                 = VECTOR_NUMBER_ICU_IRQ11,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq11 = { .p_ctrl =
		&g_external_irq11_ctrl, .p_cfg = &g_external_irq11_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq10_ctrl;
const external_irq_cfg_t g_external_irq10_cfg = { .channel = 10, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callbackup_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ10)
    .irq                 = VECTOR_NUMBER_ICU_IRQ10,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq10 = { .p_ctrl =
		&g_external_irq10_ctrl, .p_cfg = &g_external_irq10_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq9_ctrl;
const external_irq_cfg_t g_external_irq9_cfg = { .channel = 9, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callbackup_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ9)
    .irq                 = VECTOR_NUMBER_ICU_IRQ9,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq9 = { .p_ctrl =
		&g_external_irq9_ctrl, .p_cfg = &g_external_irq9_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq8_ctrl;
const external_irq_cfg_t g_external_irq8_cfg = { .channel = 8, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callbackup_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ8)
    .irq                 = VECTOR_NUMBER_ICU_IRQ8,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq8 = { .p_ctrl =
		&g_external_irq8_ctrl, .p_cfg = &g_external_irq8_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq7_ctrl;
const external_irq_cfg_t g_external_irq7_cfg = { .channel = 7, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callbackup_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ7)
    .irq                 = VECTOR_NUMBER_ICU_IRQ7,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq7 = { .p_ctrl =
		&g_external_irq7_ctrl, .p_cfg = &g_external_irq7_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq6_ctrl;
const external_irq_cfg_t g_external_irq6_cfg = { .channel = 6, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callbackup_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ6)
    .irq                 = VECTOR_NUMBER_ICU_IRQ6,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq6 = { .p_ctrl =
		&g_external_irq6_ctrl, .p_cfg = &g_external_irq6_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq5_ctrl;
const external_irq_cfg_t g_external_irq5_cfg = { .channel = 5, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callbackup_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ5)
    .irq                 = VECTOR_NUMBER_ICU_IRQ5,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq5 = { .p_ctrl =
		&g_external_irq5_ctrl, .p_cfg = &g_external_irq5_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq4_ctrl;
const external_irq_cfg_t g_external_irq4_cfg = { .channel = 4, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callbackup_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ4)
    .irq                 = VECTOR_NUMBER_ICU_IRQ4,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq4 = { .p_ctrl =
		&g_external_irq4_ctrl, .p_cfg = &g_external_irq4_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq3_ctrl;
const external_irq_cfg_t g_external_irq3_cfg = { .channel = 3, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callback_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ3)
    .irq                 = VECTOR_NUMBER_ICU_IRQ3,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq3 = { .p_ctrl =
		&g_external_irq3_ctrl, .p_cfg = &g_external_irq3_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq2_ctrl;
const external_irq_cfg_t g_external_irq2_cfg = { .channel = 2, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callback_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ2)
    .irq                 = VECTOR_NUMBER_ICU_IRQ2,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq2 = { .p_ctrl =
		&g_external_irq2_ctrl, .p_cfg = &g_external_irq2_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq1_ctrl;
const external_irq_cfg_t g_external_irq1_cfg = { .channel = 1, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callback_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ1)
    .irq                 = VECTOR_NUMBER_ICU_IRQ1,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq1 = { .p_ctrl =
		&g_external_irq1_ctrl, .p_cfg = &g_external_irq1_cfg, .p_api =
		&g_external_irq_on_icu };
icu_instance_ctrl_t g_external_irq0_ctrl;
const external_irq_cfg_t g_external_irq0_cfg = { .channel = 0, .trigger =
		EXTERNAL_IRQ_TRIG_RISING, .filter_enable = false, .pclk_div =
		EXTERNAL_IRQ_PCLK_DIV_BY_64, .p_callback = callback_icu, .p_context =
		NULL, .p_extend = NULL, .ipl = (12),
#if defined(VECTOR_NUMBER_ICU_IRQ0)
    .irq                 = VECTOR_NUMBER_ICU_IRQ0,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const external_irq_instance_t g_external_irq0 = { .p_ctrl =
		&g_external_irq0_ctrl, .p_cfg = &g_external_irq0_cfg, .p_api =
		&g_external_irq_on_icu };
agt_instance_ctrl_t g_timer1_ctrl;
const agt_extended_cfg_t g_timer1_extend =
		{ .count_source = AGT_CLOCK_PCLKB, .agto = AGT_PIN_CFG_DISABLED,
				.agtoa = AGT_PIN_CFG_DISABLED, .agtob = AGT_PIN_CFG_DISABLED,
				.measurement_mode = AGT_MEASURE_DISABLED, .agtio_filter =
						AGT_AGTIO_FILTER_NONE, .enable_pin =
						AGT_ENABLE_PIN_NOT_USED, .trigger_edge =
						AGT_TRIGGER_EDGE_RISING, };
const timer_cfg_t g_timer1_cfg =
		{ .mode = TIMER_MODE_PERIODIC,
				/* Actual period: 0.0010922666666666667 seconds. Actual duty: 50%. */.period_counts =
						0x10000, .duty_cycle_counts = 0x8000, .source_div =
						(timer_source_div_t) 0, .channel = 1, .p_callback =
						callback_agt,
				/** If NULL then do not add & */
#if defined(NULL)
    .p_context           = NULL,
#else
				.p_context = &NULL,
#endif
				.p_extend = &g_timer1_extend, .cycle_end_ipl = (5),
#if defined(VECTOR_NUMBER_AGT1_INT)
    .cycle_end_irq       = VECTOR_NUMBER_AGT1_INT,
#else
				.cycle_end_irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const timer_instance_t g_timer1 = { .p_ctrl = &g_timer1_ctrl, .p_cfg =
		&g_timer1_cfg, .p_api = &g_timer_on_agt };
agt_instance_ctrl_t g_timer0_ctrl;
const agt_extended_cfg_t g_timer0_extend =
		{ .count_source = AGT_CLOCK_PCLKB, .agto = AGT_PIN_CFG_DISABLED,
				.agtoa = AGT_PIN_CFG_DISABLED, .agtob = AGT_PIN_CFG_DISABLED,
				.measurement_mode = AGT_MEASURE_DISABLED, .agtio_filter =
						AGT_AGTIO_FILTER_NONE, .enable_pin =
						AGT_ENABLE_PIN_NOT_USED, .trigger_edge =
						AGT_TRIGGER_EDGE_RISING, };
const timer_cfg_t g_timer0_cfg =
		{ .mode = TIMER_MODE_PERIODIC,
				/* Actual period: 0.0010922666666666667 seconds. Actual duty: 50%. */.period_counts =
						0x10000, .duty_cycle_counts = 0x8000, .source_div =
						(timer_source_div_t) 0, .channel = 0, .p_callback =
						callback_agt,
				/** If NULL then do not add & */
#if defined(NULL)
    .p_context           = NULL,
#else
				.p_context = &NULL,
#endif
				.p_extend = &g_timer0_extend, .cycle_end_ipl = (5),
#if defined(VECTOR_NUMBER_AGT0_INT)
    .cycle_end_irq       = VECTOR_NUMBER_AGT0_INT,
#else
				.cycle_end_irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const timer_instance_t g_timer0 = { .p_ctrl = &g_timer0_ctrl, .p_cfg =
		&g_timer0_cfg, .p_api = &g_timer_on_agt };
rtc_instance_ctrl_t g_rtc0_ctrl;
const rtc_error_adjustment_cfg_t g_rtc0_err_cfg = { .adjustment_mode =
		RTC_ERROR_ADJUSTMENT_MODE_AUTOMATIC, .adjustment_period =
		RTC_ERROR_ADJUSTMENT_PERIOD_10_SECOND, .adjustment_type =
		RTC_ERROR_ADJUSTMENT_NONE, .adjustment_value = 0, };
const rtc_cfg_t g_rtc0_cfg = { .clock_source = RTC_CLOCK_SOURCE_LOCO,
		.freq_compare_value_loco = 255, .p_err_cfg = &g_rtc0_err_cfg,
		.p_callback = NULL, .p_context = NULL, .alarm_ipl = (BSP_IRQ_DISABLED),
		.periodic_ipl = (14), .carry_ipl = (14),
#if defined(VECTOR_NUMBER_RTC_ALARM)
    .alarm_irq               = VECTOR_NUMBER_RTC_ALARM,
#else
		.alarm_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_RTC_PERIOD)
    .periodic_irq            = VECTOR_NUMBER_RTC_PERIOD,
#else
		.periodic_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_RTC_CARRY)
    .carry_irq               = VECTOR_NUMBER_RTC_CARRY,
#else
		.carry_irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const rtc_instance_t g_rtc0 = { .p_ctrl = &g_rtc0_ctrl, .p_cfg = &g_rtc0_cfg,
		.p_api = &g_rtc_on_rtc };
flash_hp_instance_ctrl_t g_flash0_ctrl;
const flash_cfg_t g_flash0_cfg = { .data_flash_bgo = false, .p_callback = NULL,
		.p_context = NULL,
#if defined(VECTOR_NUMBER_FCU_FRDYI)
    .irq                 = VECTOR_NUMBER_FCU_FRDYI,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_FCU_FIFERR)
    .err_irq             = VECTOR_NUMBER_FCU_FIFERR,
#else
		.err_irq = FSP_INVALID_VECTOR,
#endif
		.err_ipl = (BSP_IRQ_DISABLED), .ipl = (BSP_IRQ_DISABLED), };
/* Instance structure to use this module. */
const flash_instance_t g_flash0 = { .p_ctrl = &g_flash0_ctrl, .p_cfg =
		&g_flash0_cfg, .p_api = &g_flash_on_flash_hp };
sci_uart_instance_ctrl_t g_uart9_ctrl;

baud_setting_t g_uart9_baud_setting = {
/* Baud rate calculated with 0.160% error. */.abcse = 0, .abcs = 0, .bgdm = 1,
		.cks = 0, .brr = 64, .mddr = (uint8_t) 256, .brme = false };

